# How to upload csv data file to pandas data frame?

Implement ```pandas.read_csv(filename)``` to upload the data from ```csv``` data file. When data is loaded simply by providing the data file name only, it uses the first row as the column names. The uploaded dataframe will be missing data index.

In [13]:
import pandas as pd
df = pd.read_csv('data/titanic.csv')
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

## While loading data to pandas dataframe:

###  How to set column names while loading ```csv``` data to pandas dataframe?

In case your data file is missing column names, you can provide the list of column in a the same order as you are intending to put the column names.

In [17]:
df2 = pd.read_csv('data/titanic-nocol.csv')
df2.head(1)

,1,0,3,"Braund, Mr. Owen Harris",male,22,1.1,0.1,A/5 21171,7.25,Unnamed: 10,S
0,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [18]:
colnames = ['PassengerId','Survived','Pclass','Name','Sex','Age',\
            'SibSp','Parch','Ticket','Fare','Cabin','Embarked']

In [20]:
df2 = pd.read_csv('data/titanic-nocol.csv',names = colnames)
df2.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

### How to set index while loading ```csv``` data to pandas dataframe?

You can set a certain column as the ```index``` of the ```DataFrame``` object. Setting index hase special benefit on accessing data in pandas data frame.

In [23]:
import pandas as pd
df = pd.read_csv('data/titanic.csv', index_col = "Name")
df.head(1)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.25,NaN,S

In case you data exist in a ```Dataframe``` and you want to set certain colume as index, implement ```DataFrame.set_index("column_name")```.

In [25]:
import pandas as pd
df = pd.read_csv('data/titanic.csv')
df = df.set_index("Name")
df.head(1)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.25,NaN,S

### How  to know shape of the data loaded to pandas data frame?

In [4]:
import pandas as pd
df = pd.read_csv('data/titanic.csv')

In [6]:
df.shape

(891, 12)

### How to find list of column names from uploaded data in pandas data frame?

In [8]:
import pandas as pd
df = pd.read_csv('data/titanic.csv')

In [9]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### How to find the list of index name from uploaded data?

In [26]:
import pandas as pd
df = pd.read_csv('data/titanic.csv', index_col = "Name")
df.index

Index(['Braund, Mr. Owen Harris',
       'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
       'Heikkinen, Miss. Laina',
       'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
       'Allen, Mr. William Henry', 'Moran, Mr. James',
       'McCarthy, Mr. Timothy J', 'Palsson, Master. Gosta Leonard',
       'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
       'Nasser, Mrs. Nicholas (Adele Achem)',
       ...
       'Markun, Mr. Johann', 'Dahlberg, Miss. Gerda Ulrika',
       'Banfield, Mr. Frederick James', 'Sutehall, Mr. Henry Jr',
       'Rice, Mrs. William (Margaret Norton)', 'Montvila, Rev. Juozas',
       'Graham, Miss. Margaret Edith',
       'Johnston, Miss. Catherine Helen "Carrie"', 'Behr, Mr. Karl Howell',
       'Dooley, Mr. Patrick'],
      dtype='object', name='Name', length=891)